Revit 2027 API
SchemaCommon.Keyword Property
 The property labeled "Keyword" common to all visual Asset types.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string Keyword { get; }
Public Shared ReadOnly Property Keyword As String
	Get
public:
static property String^ Keyword {
	String^ get ();
}
static member Keyword : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyString". Use ":" to add several keywords.
See Also
Reference
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace